cmsis-svd/cmsis-svd/data/NXP/LPC1125.svd
  		</registers>
  	</peripheral>
<peripheral>
	<name>UART0</name>
	<description>UART0</description>
	<groupName>UART0</groupName>
	<baseAddress>0x40008000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>UART0</name>
	<value>21</value>
	</interrupt>
	<registers>
	<register>
		<name>RBR</name>
		<description>Receiver Buffer Register. Contains the next received character to be read. (DLAB=0)</description>
		<addressOffset>0x000</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<readAction>modify</readAction>
		<fields>
			<field>
				<name>RBR</name>
				<description>The UART Receiver Buffer Register contains the oldest received byte in the UART RX FIFO.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>THR</name>
		<description>Transmit Holding Register. The next character to be transmitted is written here. (DLAB=0)</description>
		<alternateRegister>RBR</alternateRegister>
		<addressOffset>0x000</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<readAction>modify</readAction>
		<fields>
			<field>
				<name>THR</name>
				<description>Writing to the UART Transmit Holding Register causes the data to be stored in the UART transmit FIFO. The byte will be sent when it is the oldest byte in the FIFO and the transmitter is available.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DLL</name>
		<description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>
		<alternateRegister>RBR</alternateRegister>
		<addressOffset>0x000</addressOffset>
		<access>read-write</access>
		<resetValue>0x01</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DLLSB</name>
				<description>The UART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the UART.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DLM</name>
		<description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>
		<addressOffset>0x004</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DLMSB</name>
				<description>The UART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the UART.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>IER</name>
		<description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts. (DLAB=0)</description>
		<alternateRegister>DLM</alternateRegister>
		<addressOffset>0x004</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RBRINTEN</name>
				<description>RBR Interrupt Enable. Enables the Receive Data Available interrupt. It also controls the Character Receive Time-out interrupt.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable the RDA interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable the RDA interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>THREINTEN</name>
				<description>THRE Interrupt Enable. Enables the THRE interrupt. The status of this interrupt can be read from LSR[5].</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable the THRE interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable the THRE interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RLSINTEN</name>
				<description>Enables the Receive Line Status interrupt. The status of this interrupt can be read from LSR[4:1].</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable the RLS interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable the RLS interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MSINTEN</name>
				<description>Enables the Modem Status interrupt. The components of this interrupt can be read from the MSR.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable the MS interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable the MS interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[7:4]</bitRange>
			</field>
			<field>
				<name>ABEOINTEN</name>
				<description>Enables the end of auto-baud interrupt.</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable end of auto-baud Interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable end of auto-baud Interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>ABTOINTEN</name>
				<description>Enables the auto-baud time-out interrupt.</description>
				<bitRange>[9:9]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable auto-baud time-out Interrupt.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable auto-baud time-out Interrupt.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>IIR</name>
		<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
		<addressOffset>0x008</addressOffset>
		<access>read-only</access>
		<resetValue>0x01</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INTSTATUS</name>
				<description>Interrupt status. Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1].</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INTERRUPT_PENDING</name>
						<description>Interrupt pending. At least one interrupt is pending.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NOT_PENDING</name>
						<description>Not pending. No interrupt is pending.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>INTID</name>
				<description>Interrupt identification. IER[3:1] identifies an interrupt corresponding to the UART Rx FIFO. All other values of IER[3:1] not listed below are reserved.</description>
				<bitRange>[3:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RLS</name>
						<description>RLS. 1   - Receive Line Status .</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RDA</name>
						<description>RDA. 2a - Receive Data Available.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CTI</name>
						<description>CTI. 2b - Character Time-out Indicator.</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRE</name>
						<description>THRE. 3   - THRE Interrupt.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MODEM_STATUS</name>
						<description>Modem status. 4   - Modem status</description>
						<value>0x0</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[5:4]</bitRange>
			</field>
			<field>
				<name>FIFOEN</name>
				<description>These bits are equivalent to FCR[0].</description>
				<bitRange>[7:6]</bitRange>
			</field>
			<field>
				<name>ABEOINT</name>
				<description>End of auto-baud interrupt. True if auto-baud has finished successfully and interrupt is enabled.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>ABTOINT</name>
				<description>Auto-baud time-out interrupt. True if auto-baud has timed out and interrupt is enabled.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>FCR</name>
		<description>FIFO Control Register. Controls UART FIFO usage and modes.</description>
		<alternateRegister>IIR</alternateRegister>
		<addressOffset>0x008</addressOffset>
		<access>write-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FIFOEN</name>
				<description>FIFO enable</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. UART FIFOs are disabled. Must not be used in the application.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Active high enable for both UART Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper UART operation. Any transition on this bit will automatically clear the UART FIFOs.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RXFIFORES</name>
				<description>RX FIFO Reset</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect. No impact on either of UART FIFOs.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Writing a logic 1 to FCR[1] will clear all bytes in UART Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>TXFIFORES</name>
				<description>TX FIFO Reset</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect. No impact on either of UART FIFOs.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Writing a logic 1 to FCR[2] will clear all bytes in UART TX FIFO, reset the pointer logic. This bit is self-clearing.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[5:3]</bitRange>
			</field>
			<field>
				<name>RXTL</name>
				<description>RX Trigger Level. These two bits determine how many UART FIFO characters must be received by the FIFO before an interrupt is activated.</description>
				<bitRange>[7:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TRIGGER_LEVEL_0</name>
						<description>Trigger level 0. (1 character or 0x01).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TRIGGER_LEVEL_1</name>
						<description>Trigger level 1. (4 characters or 0x04).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TRIGGER_LEVEL_2</name>
						<description>Trigger level 2. (8 characters or 0x08).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TRIGGER_LEVEL_3</name>
						<description>Trigger level 3. (14 characters or 0x0E).</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>LCR</name>
		<description>Line Control Register. Contains controls for frame formatting and break generation.</description>
		<addressOffset>0x00C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>WLS</name>
				<description>Word Length Select</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>5_BIT</name>
						<description>5 bit. 5-bit character length.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>6_BIT</name>
						<description>6 bit. 6-bit character length.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>7_BIT</name>
						<description>7 bit. 7-bit character length.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_BIT</name>
						<description>8 bit. 8-bit character length.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SBS</name>
				<description>Stop Bit Select</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>1_STOP_BIT</name>
						<description>1 stop bit.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>2_STOP_BITS</name>
						<description>2 stop bits. (1.5 if LCR[1:0]=00).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PE</name>
				<description>Parity Enable</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable parity generation and checking.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable parity generation and checking.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PS</name>
				<description>Parity Select</description>
				<bitRange>[5:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ODD_PARITY</name>
						<description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EVEN_PARITY</name>
						<description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FORCED_1_STICK_PARIT</name>
						<description>Forced 1 stick parity.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FORCED_0_STICK_PARIT</name>
						<description>Forced 0 stick parity.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>BC</name>
				<description>Break Control</description>
				<bitRange>[6:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable break transmission.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable break transmission. Output pin UART TXD is forced to logic 0 when LCR[6] is active high.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>DLAB</name>
				<description>Divisor Latch Access Bit</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable access to Divisor Latches.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable access to Divisor Latches.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MCR</name>
		<description>Modem Control Register.</description>
		<addressOffset>0x010</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DTRCTRL</name>
				<description>Source for modem output pin DTR. This bit reads as 0 when modem loopback mode is active.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>RTSCTRL</name>
				<description>Source for modem output pin RTS. This bit reads as 0 when modem loopback mode is active.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[3:2]</bitRange>
			</field>
			<field>
				<name>LMS</name>
				<description>Loopback Mode Select. The modem loopback mode provides a mechanism to perform diagnostic loopback testing. Serial data from the transmitter is connected internally to serial input of the receiver. Input pin, RXD, has no effect on loopback and output pin, TXD is held in marking state. The DSR, CTS, DCD, and RI pins are ignored. Externally, DTR and  RTS are set inactive. Internally, the upper four bits of the MSR are driven by the lower four bits of the MCR. This permits modem status interrupts to be generated in loopback mode by writing the lower four bits of MCR.</description>
				<bitRange>[4:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable modem loopback mode.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable modem loopback mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>RTSEN</name>
				<description>RTS enable</description>
				<bitRange>[6:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable auto-rts flow control.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable auto-rts flow control.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CTSEN</name>
				<description>CTS enable</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable. Disable auto-cts flow control.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable. Enable auto-cts flow control.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
