cmsis-svd/cmsis-svd/data/NXP/LPC1125.svd
	<register>
		<name>EMR</name>
		<description>External Match register (EMR). The EMR controls the match function and the external match pins CT32B0_MAT[3:0].</description>
		<addressOffset>0x03C</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>EM0</name>
				<description>External Match 0. This bit reflects the state of output CT32Bn_MAT0, whether or not this output is connected to its pin. When a match occurs between the TC and MR0, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[5:4] control the functionality of this output. This bit is driven to the CT32B0_MAT0/CT16B1_MAT0 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>EM1</name>
				<description>External Match 1. This bit reflects the state of output CT32Bn_MAT1, whether or not this output is connected to its pin. When a match occurs between the TC and MR1, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[7:6] control the functionality of this output. This bit is driven to the CT32B0_MAT1/CT16B1_MAT1 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>EM2</name>
				<description>External Match 2. This bit reflects the state of output CT32Bn_MAT2, whether or not this output is connected to its pin. When a match occurs between the TC and MR2, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[9:8] control the functionality of this output. This bit is driven to the CT32B0_MAT2/CT16B1_MAT2 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>EM3</name>
				<description>External Match 3. This bit reflects the state of output CT32Bn_MAT3, whether or not this output is connected to its pin. When a match occurs between the TC and MR3, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[11:10] control the functionality of this output. This bit is driven to the CT32B0_MAT3/CT16B1_MAT3 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>EMC0</name>
				<description>External Match Control 0. Determines the functionality of External Match 0.</description>
				<bitRange>[5:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DO_NOTHING</name>
						<description>Do Nothing.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SET</name>
						<description>Set. Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TOGGLE</name>
						<description>Toggle. Toggle the corresponding External Match bit/output.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EMC1</name>
				<description>External Match Control 1. Determines the functionality of External Match 1.</description>
				<bitRange>[7:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DO_NOTHING</name>
						<description>Do Nothing.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SET</name>
						<description>Set. Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TOGGLE</name>
						<description>Toggle. Toggle the corresponding External Match bit/output.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EMC2</name>
				<description>External Match Control 2. Determines the functionality of External Match 2.</description>
				<bitRange>[9:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DO_NOTHING</name>
						<description>Do Nothing.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SET</name>
						<description>Set. Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TOGGLE</name>
						<description>Toggle. Toggle the corresponding External Match bit/output.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EMC3</name>
				<description>External Match Control 3. Determines the functionality of External Match 3.</description>
				<bitRange>[11:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DO_NOTHING</name>
						<description>Do Nothing.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CLEAR</name>
						<description>Clear. Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SET</name>
						<description>Set. Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TOGGLE</name>
						<description>Toggle. Toggle the corresponding External Match bit/output.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:12]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CTCR</name>
		<description>Count Control register (CTCR). The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>
		<addressOffset>0x070</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CTM</name>
				<description>Counter/Timer Mode. This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). Timer Mode: every rising PCLK edge</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>TIMER_MODE</name>
						<description>Timer mode. Timer Mode: every rising PCLK edge</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>COUNTER_MODE_RISING</name>
						<description>Counter mode rising edge. Counter Mode: TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>COUNTER_MODE_FALLING</name>
						<description>Counter mode falling edge. Counter Mode: TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>COUNTER_MODE_EDGES</name>
						<description>Counter mode edges. Counter Mode: TC is incremented on both edges on the CAP input selected by bits 3:2.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CIS</name>
				<description>Count Input Select. When bits 1:0 in this register are not 00, these bits select which CAP pin is sampled for clocking:</description>
				<bitRange>[3:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CT32BN_CAP0</name>
						<description>CT32Bn_CAP0</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT32BN_CAP1</name>
						<description>CT32Bn_CAP1</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>ENCC</name>
				<description>Setting this bit to one enables clearing of the timer and the prescaler when the capture-edge event specified in bits 7:5 occurs.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>SELCC</name>
				<description>When bit 4 is one, these bits select which capture input edge will cause the timer and prescaler to be cleared. These bits have no effect when bit 4 is zero.</description>
				<bitRange>[7:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RIDING_EDGE_CAP0</name>
						<description>Riding edge CAP0. Rising Edge of CAP0 clears the timer (if bit 4 is set).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FALLING_EDGE_CAP1</name>
						<description>Falling edge CAP1. Falling Edge of CAP0 clears the timer (if bit 4 is set).</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RISING_EDGE_CAP1</name>
						<description>Rising edge CAP1. Rising Edge of CAP1 clears the timer (if bit 4 is set).</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FALLING_EDGE_CAP1</name>
						<description>Falling edge CAP1. Falling Edge of CAP1 clears the timer (if bit 4 is set).</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x7</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PWMC</name>
		<description>PWM Control register (PWMCON). The PWMCON enables PWM mode for the external match pins CT32B0_MAT[3:0].</description>
		<addressOffset>0x074</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>PWMEN0</name>
				<description>PWM channel 0 enable</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>EM0</name>
						<description>EM0. CT32Bn_MAT0 is controlled by EM0.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MAT0</name>
						<description>MAT0. PWM mode is enabled for CT32Bn_MAT0.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PWMEN1</name>
				<description>PWM channel 1 enable</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>EM1</name>
						<description>EM1. CT32Bn_MAT1 is controlled by EM1.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MAT1</name>
						<description>MAT1. PWM mode is enabled for CT32Bn_MAT1.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PWMEN2</name>
				<description>PWM channel 2 enable</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>EM2</name>
						<description>EM2. CT32Bn_MAT2 is controlled by EM2.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MAT2</name>
						<description>MAT2. PWM mode is enabled for CT32Bn_MAT2.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>PWMEN3</name>
				<description>PWM channel 3 enable Note: It is recommended to use match channel 3 to set the PWM cycle.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>EM3</name>
						<description>EM3. CT32Bn_MAT3 is controlled by EM3.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MAT3</name>
						<description>MAT3. PWM mode is enabled for CT32Bn_MAT3.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
