cmsis-svd/cmsis-svd/data/NXP/LPC1125.svd
</registers>
</peripheral>
	<peripheral derivedFrom="CT32B0">
		<name>CT32B1</name>
		<baseAddress>0x40018000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0x1000</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>CT32B1</name>
			<value>19</value>
		</interrupt>
	</peripheral>
	<peripheral>
	<name>ADC</name>
	<description>12-bit ADC</description>
	<groupName>ADC</groupName>
	<baseAddress>0x4001C000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0x1000</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>ADC_A</name>
			<value>24</value>
		</interrupt>
		<interrupt>
			<name>ADC_B</name>
			<value>13</value>
		</interrupt>
	<registers>
	<register>
		<name>CTRL</name>
		<description>A/D Control Register. Contains the clock divide value, enable bits for each sequence and the A/D power-down bit.</description>
		<addressOffset>0x000</addressOffset>
		<access>read-write</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CLKDIV</name>
				<description>The system clock is divided by this value plus one to produce the clock for the A/D converter, which should be less than or equal to 50 MHz (up to 100 MHz in 10-bit mode).  Typically, software should program the smallest value in this field that yields this maximum clock rate or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[9:8]</bitRange>
			</field>
			<field>
				<name>LPWRMODE</name>
				<description>Select low-power ADC mode. The analog circuitry is automatically powered-down when no conversions are taking place. When any (hardware or software) triggering event is detected, the analog circuitry is enabled. After the required start-up time, the requested conversion will be launched. Once the conversion completes, the analog-circuitry will again be powered-down provided no further conversions are pending. Using this mode can save an appreciable amount of current (approximately 2.5 mA) when conversions are required relatively infrequently. The penalty for using this mode is an approximately 15 ADC clock delay (30 clocks in 10-bit mode), based on the frequency specified in the CLKDIV field, from the time the trigger event occurs until sampling of the A/D input commences. This mode will NOT power-up the A/D if the ADC_ENA bit is low.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. The low-power ADC mode is disabled.  The analog circuitry remains activated even when no conversions are requested.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. The low-power ADC mode is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CAL_MODE</name>
				<description>Writing a 1 to this bit initiates a self-calibration cycle. This bit will be automatically cleared by hardware after the calibration cycle is complete. Other bits of this register may be written to concurrently with setting this bit, however once this bit has been set no further writes to this register are permitted until the full calibration cycle has ended.</description>
				<bitRange>[30:30]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SEQA_CTRL</name>
		<description>A/D Conversion Sequence-A control Register: Controls triggering and channel selection for conversion sequence-A. Also specifies interrupt mode for sequence-A.</description>
		<addressOffset>0x008</addressOffset>
		<access>read-write</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CHANNELS</name>
				<description>Selects which one or more of the twelve channels will be sampled and converted when this sequence is launched. A 1 in any bit of this field will cause the corresponding channel to be included in the conversion sequence, where bit 0 corresponds to channel 0, bit 1 to channel 1 and so forth.  When this conversion sequence is triggered, either by a hardware trigger or via software command, A/D conversions will be performed on each enabled channel, in sequence, beginning with the lowest-ordered channel.  This field can ONLY be changed while the SEQA_ENA bit (bit 31) is LOW. It is allowed to change this field and set bit 31 in the same write.</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>TRIGGER</name>
				<description>Selects which of the available hardware trigger sources will cause this conversion sequence to be initiated. Program the trigger input number in this field. In order to avoid generating a spurious trigger, it is recommended writing to this field only when the SEQA_ENA bit (bit 31) is low. It is safe to change this field and set bit 31 in the same write.</description>
				<bitRange>[17:12]</bitRange>
			</field>
			<field>
				<name>TRIGPOL</name>
				<description>Select the polarity of the selected input trigger for this conversion sequence.  In order to avoid generating a spurious trigger, it is recommended writing to this field only when the SEQA_ENA bit (bit 31) is low. It is safe to change this field and set bit 31 in the same write.</description>
				<bitRange>[18:18]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NEGATIVE_EDGE</name>
						<description>Negative edge. A negative edge launches the conversion sequence on the selected trigger input.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>POSITIVE_EDGE</name>
						<description>Positive edge. A positive edge launches the conversion sequence on the selected trigger input.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCBYPASS</name>
				<description>Setting this bit allows the hardware trigger input to bypass  synchronization flip-flops stages and therefore shorten the time between the trigger input signal and the start of a conversion. There are slightly different criteria for whether or not this bit can be set depending on the clock operating mode: Synchronous mode: Synchronization may be bypassed (this bit may be set) if the selected trigger source is already synchronous with the main system clock (eg. coming from an on-chip, system-clock-based timer). Whether this bit is set or not, a trigger pulse must be maintained for at least one system clock period. Asynchronous mode: Synchronization may be bypassed (this bit may be set) if it is certain that the duration of a trigger input pulse will be at least one cycle of the ADC clock (regardless of whether the trigger comes from and on-chip or off-chip source). If this bit is NOT set, the trigger pulse must at least be maintained for one system clock period.</description>
				<bitRange>[19:19]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLE_SYNCHRONIZATI</name>
						<description>Enable synchronization. The hardware trigger bypass is not enabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>BYPASS_SYNCHRONIZATI</name>
						<description>Bypass synchronization. The hardware trigger bypass is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[25:20]</bitRange>
			</field>
			<field>
				<name>START</name>
				<description>Writing a 1 to this field will launch one pass through this conversion sequence. The behavior will be identical to a sequence triggered by a hardware trigger. Do not write 1 to this bit if the BURST bit is set. This bit is only set to a 1 momentarily when written-to in order to launch a conversion sequence. It will consequently always read-back as a zero.</description>
				<bitRange>[26:26]</bitRange>
			</field>
			<field>
				<name>BURST</name>
				<description>Writing a 1 to this bit will cause this conversion sequence to be continuously cycled through. Other sequence A triggers will be ignored while this bit is set. Repeated conversions can be halted by clearing this bit. The sequence currently in progress will be completed before conversions are terminated.</description>
				<bitRange>[27:27]</bitRange>
			</field>
			<field>
				<name>SINGLESTEP</name>
				<description>When this bit is set, a hardware trigger or a write to the START bit will launch a single conversion on the next channel in the sequence instead of the default response of launching an entire sequence of conversions. Once all of the channels comprising a sequence have been converted, a subsequent trigger will repeat the sequence beginning with the first enabled channel. Interrupt generation will still occur either after each individual conversion or at the end of the entire sequence, depending on the state of the MODE bit.</description>
				<bitRange>[28:28]</bitRange>
			</field>
			<field>
				<name>LOWPRIO</name>
				<description>Set priority for sequence A.</description>
				<bitRange>[29:29]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>LOW_PRIORITY</name>
						<description>Low priority. Any B trigger which occurs while an A conversion sequence is active will be ignored and lost.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>HIGH_PRIORITY</name>
						<description>High priority.  Setting this bit to a 1 will permit any enabled B sequence trigger (including a B sequence software start) to immediately interrupt this sequence and launch a B sequence in it's place. The conversion currently in progress will be terminated.  The A sequence that was interrupted will automatically resume after the B sequence completes. The channel whose conversion was terminated will be re-sampled and the conversion sequence will resume from that point.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Indicates whether the primary method for retrieving conversion results for this sequence will be accomplished via reading the global data register (SEQA_GDAT) at the end of each conversion, or the individual channel result registers at the end of the entire sequence.  Impacts when conversion-complete interrupt for sequence-A will be generated and which overrun conditions contribute to an overrun interrupt as described below:</description>
				<bitRange>[30:30]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>END_OF_CONVERSION</name>
						<description>End of conversion. The sequence A interrupt will be set at the end of each individual A/D conversion performed under sequence A. This flag will mirror the DATAVALID bit in the SEQA_GDAT register. The OVERRUN bit in the SEQA_GDAT register will contribute to generation of an overrun interrupt if enabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>END_OF_SEQUENCE</name>
						<description>End of sequence. The sequence A interrupt will be set when the entire set of sequence-A conversions completes. This flag will need to be explicitly cleared by software in this mode.  The OVERRUN bit in the SEQA_GDAT register will NOT contribute to generation of an overrun interrupt since it is assumed this register may not be utilized in this mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SEQA_ENA</name>
				<description>Sequence Enable. In order to avoid spuriously triggering the sequence, care should be taken to only set the SEQA_ENA bit  when the selected trigger input is in its INACTIVE state (as defined by the TRIGPOL bit). If this condition is  not met, the sequence will be triggered immediately upon being enabled.</description>
				<bitRange>[31:31]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Sequence A is disabled. Sequence A triggers are ignored. If this bit is cleared while sequence A is in progress, the sequence will be halted at the end of the current conversion. After the sequence is re-enabled, a new trigger will be required to restart the sequence beginning with the next enabled channel.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Sequence A is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
		</fields>
	</register>
	<register>
		<name>SEQB_CTRL</name>
		<description>A/D Conversion Sequence-B Control Register: Controls triggering and channel selection for conversion sequence-B. Also specifies interrupt mode for sequence-B.</description>
		<addressOffset>0x00C</addressOffset>
		<access>read-write</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CHANNELS</name>
				<description>Selects which one or more of the twelve channels will be sampled and converted when this sequence is launched. A 1 in any bit of this field will cause the corresponding channel to be included in the conversion sequence, where bit 0 corresponds to channel 0, bit 1 to channel 1 and so forth.  When this conversion sequence is triggered, either by a hardware trigger or via software command, A/D conversions will be performed on each enabled channel, in sequence, beginning with the lowest-ordered channel. This field can ONLY be changed while the SEQB_ENA bit (bit 31) is LOW. It is permissible to change this field and set bit 31 in the same write.</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>TRIGGER</name>
				<description>Selects which of the available hardware trigger sources will cause this conversion sequence to be initiated. Program the trigger input number in this field.  In order to avoid generating a spurious trigger, it is recommended  writing to this field only when the SEQA_ENA bit (bit 31) is low. It is safe to  change this field and set bit 31 in the same write.</description>
				<bitRange>[17:12]</bitRange>
			</field>
			<field>
				<name>TRIGPOL</name>
				<description>Select the polarity of the selected input trigger for this conversion sequence.  In order to avoid generating a spurious trigger, it is recommended  writing to this field only when the SEQA_ENA bit (bit 31) is low. It is safe to  change this field and set bit 31 in the same write.</description>
				<bitRange>[18:18]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NEGATIVE_EDGE</name>
						<description>Negative edge. A negative edge launches the conversion sequence on the selected trigger input.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>POSITIVE_EDGE</name>
						<description>Positive edge. A positive edge launches the conversion sequence on the selected trigger input.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SYNCBYPASS</name>
				<description>Setting this bit allows the hardware trigger input to bypass  synchronization flip-flops stages and therefore shorten the time between the trigger input signal and the start of a conversion. There are slightly different criteria for whether or not this bit can be set depending on the clock operating mode: Synchronous mode: Synchronization may be bypassed (this bit may be set) if the selected trigger source is already synchronous with the main system clock (eg. coming from an on-chip, system-clock-based timer). Whether this bit is set or not, a trigger pulse must be maintained for at least one system clock period. Asynchronous mode: Synchronization may be bypassed (this bit may be set) if it is certain that the duration of a trigger input pulse will be at least one cycle of the ADC clock (regardless of whether the trigger comes from and on-chip or off-chip source). If this bit is NOT set, the trigger pulse must at least be maintained for one system clock period.</description>
				<bitRange>[19:19]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLE_SYNCHRONIZATI</name>
						<description>Enable synchronization. The hardware trigger bypass is not enabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>BYPASS_SYNCHRONIZATI</name>
						<description>Bypass synchronization. The hardware trigger bypass is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[25:20]</bitRange>
			</field>
			<field>
				<name>START</name>
				<description>Writing a 1 to this field will launch one pass through this conversion sequence. The behavior will be identical to a sequence triggered by a hardware trigger. Do not write a 1 to this bit if the BURST bit is set.   This bit is only set to a 1 momentarily when written to in order to launch a conversion sequence. It will consequently always read-back as a zero.</description>
				<bitRange>[26:26]</bitRange>
			</field>
			<field>
				<name>BURST</name>
				<description>Writing a 1 to this bit will cause this conversion sequence to be continuously cycled through. Other B triggers will be ignored while this bit is set.  Repeated conversions can be halted by clearing this bit. The sequence currently in progress will be completed before conversions are terminated.</description>
				<bitRange>[27:27]</bitRange>
			</field>
			<field>
				<name>SINGLESTEP</name>
				<description>When this bit is set, a hardware trigger or a write to the START bit will launch a single conversion on the next channel in the sequence instead of the default response of launching an entire sequence of conversions. Once all of the channels comprising a sequence have been converted, a subsequent trigger will repeat the sequence beginning with the first enabled channel.  Interrupt generation will still occur either after each individual conversion or at the end of the entire sequence, depending on the state of the MODE bit.</description>
				<bitRange>[28:28]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[29:29]</bitRange>
			</field>
			<field>
				<name>MODE</name>
				<description>Indicates whether the primary method for retrieving conversion results for this sequence will be accomplished via reading the global data register (SEQB_GDAT) at the end of each conversion, or the individual channel result registers at the end of the entire sequence.   Impacts when conversion-complete interrupt for sequence-B will be generated and which overrun conditions contribute to an overrun interrupt as described below:</description>
				<bitRange>[30:30]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>END_OF_CONVERSION</name>
						<description>End of conversion. The sequence B interrupt will be set at the end of each individual A/D conversion performed under sequence B. This flag will mirror the DATAVALID bit in the SEQB_GDAT register.  The OVERRUN bit in the SEQB_GDAT register will contribute to generation of an overrun interrupt if enabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>END_OF_SEQUENCE</name>
						<description>End of sequence. The sequence B interrupt will be set when the entire set of sequence B conversions completes. This flag will need to be explicitly cleared by software in this mode.   The OVERRUN bit in the SEQB_GDAT register will NOT contribute to generation of an overrun interrupt since it is assumed this register will not be utilized in this mode.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SEQB_ENA</name>
				<description>Sequence Enable. In order to avoid spuriously triggering the sequence, care should be taken to only set the SEQA_ENA bit  when the selected trigger input is in its INACTIVE state (as defined by the TRIGPOL bit). If this condition is  not met, the sequence will be triggered immediately upon being enabled.</description>
				<bitRange>[31:31]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. Sequence B is disabled. Sequence B triggers are ignored. If this bit is cleared while sequence B is in progress, the sequence will be halted at the end of the current conversion. After the sequence is re-enabled, a new trigger will be required to restart the sequence beginning with the next enabled channel.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Sequence B is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
		</fields>
	</register>
