cmsis-svd/cmsis-svd/data/NXP/LPC1125.svd
	<register>
		<name>SEQA_GDAT</name>
		<description>A/D Sequence-A Global Data Register. This register contains the result of the most recent A/D conversion performed under sequence-A</description>
		<addressOffset>0x010</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<readAction>modify</readAction>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESULT</name>
				<description>This field contains the 12-bit A/D conversion result from the most recent conversion performed under conversion sequence associated with this register.   The result is the  a binary fraction representing the voltage on the currently-selected input channel as it falls within the range of VREFP to VREFN. Zero in the field indicates that the voltage on the input pin was less than, equal to, or close to that on VREFN, while 0xFFF indicates that the voltage on the input was close to, equal to, or greater than that on VREFP.  DATAVALID = 1 indicates that this result has not yet been read.</description>
				<bitRange>[15:4]</bitRange>
			</field>
			<field>
				<name>THCMPRANGE</name>
				<description>Indicates whether the result of the last conversion performed was above, below or within the range established by the designated threshold comparison registers (THRn_LOW and THRn_HIGH).</description>
				<bitRange>[17:16]</bitRange>
			</field>
			<field>
				<name>THCMPCROSS</name>
				<description>Indicates whether the result of the last conversion performed represented a crossing of the threshold level established by the designated LOW threshold comparison register (THRn_LOW) and, if so, in what direction the crossing occurred.</description>
				<bitRange>[19:18]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[25:20]</bitRange>
			</field>
			<field>
				<name>CHN</name>
				<description>These bits contain the channel from which the RESULT bits were converted (e.g. 0000 identifies channel 0, 0001 channel 1...).</description>
				<bitRange>[29:26]</bitRange>
			</field>
			<field>
				<name>OVERRUN</name>
				<description>This bit is set if a new conversion result is loaded into the RESULT field before a previous result has been read - i.e. while the DATAVALID bit is set. This bit is cleared, along with the DATAVALID bit, whenever this register is read.  This bit will contribute to an overrun interrupt request if the MODE bit (in SEQA_CTRL) for the corresponding sequence is set to '0' (and if the overrun interrupt is enabled).</description>
				<bitRange>[30:30]</bitRange>
			</field>
			<field>
				<name>DATAVALID</name>
				<description>This bit is set to '1' at the end of each conversion when a new result is loaded into the RESULT field. It is cleared whenever this register is read.  This bit will cause a conversion-complete interrupt for the corresponding sequence if the MODE bit (in SEQA_CTRL) for that sequence is set to 0 (and if the interrupt is enabled).</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SEQB_GDAT</name>
		<description>A/D Sequence-B Global Data Register. This register contains the result of the most recent A/D conversion performed under sequence-B</description>
		<addressOffset>0x014</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<readAction>modify</readAction>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESULT</name>
				<description>This field contains the 12-bit A/D conversion result from the most recent conversion performed under conversion sequence associated with this register.   This will be a binary fraction representing the voltage on the currently-selected input channel as it falls within the range of VREFP to VREFN. Zero in the field indicates that the voltage on the input pin was less than, equal to, or close to that on VREFN, while 0xFFF indicates that the voltage on the input was close to, equal to, or greater than that on V REFP.  DATAVALID = 1 indicates that this result has not yet been read.</description>
				<bitRange>[15:4]</bitRange>
			</field>
			<field>
				<name>THCMPRANGE</name>
				<description>Indicates whether the result of the last conversion performed was above, below or within the range established by the designated threshold comparison registers (THRn_LOW and THRn_HIGH).  Threshold Range Comparison result. 0x0 = In Range: The last completed conversion was greater than or equal to the value programmed into the designated LOW threshold register (THRn_LOW) but less than or equal to the value programmed into the designated HIGH threshold register (THRn_HIGH). 0x1 = Below Range: The last completed conversion on was less than the value programmed into the designated LOW threshold register (THRn_LOW). 0x2 = Above Range: The last completed conversion was greater than the value programmed into the designated HIGH threshold register (THRn_HIGH). 0x3 = Reserved.</description>
				<bitRange>[17:16]</bitRange>
			</field>
			<field>
				<name>THCMPCROSS</name>
				<description>Indicates whether the result of the last conversion performed represented a crossing of the threshold level established by the designated LOW threshold comparison register (THRn_LOW) and, if so, in what direction the crossing occurred. 0x0 = No threshold Crossing detected: The most recent completed conversion on this channel had the same relationship (above or below) to the threshold value established by the designated LOW threshold register (THRn_LOW) as did the previous conversion on this channel. 0x1 = Reserved. 0x2 = Downward Threshold Crossing Detected. Indicates that a threshold crossing in the downward direction has occurred - i.e. the previous sample on this channel was above the threshold value established by the designated LOW threshold register (THRn_LOW) and the current sample is below that threshold. 0x3 = Upward Threshold Crossing Detected. Indicates that a threshold crossing in the upward direction has occurred - i.e. the previous sample on this channel was below the threshold value established by the designated LOW threshold register (THRn_LOW) and the current sample is above that threshold.</description>
				<bitRange>[19:18]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[25:20]</bitRange>
			</field>
			<field>
				<name>CHN</name>
				<description>These bits contain the channel from which the RESULT bits were converted (e.g. 0b0000 identifies channel 0, 0b0001 channel 1...).</description>
				<bitRange>[29:26]</bitRange>
			</field>
			<field>
				<name>OVERRUN</name>
				<description>This bit is set if a new conversion result is loaded into the RESULT field before a previous result has been read - i.e. while the DATAVALID bit is set. This bit is cleared, along with the DATAVALID bit, whenever this register is read.  This bit will contribute to an overrun interrupt request if the MODE bit (in SEQB_CTRL) for the corresponding sequence is set to 0 (and if the overrun interrupt is enabled).</description>
				<bitRange>[30:30]</bitRange>
			</field>
			<field>
				<name>DATAVALID</name>
				<description>This bit is set to 1 at the end of each conversion when a new result is loaded into the RESULT field. It is cleared whenever this register is read.  This bit will cause a conversion-complete interrupt for the corresponding sequence if the MODE bit (in SEQB_CTRL) for that sequence is set to 0 (and if the interrupt is enabled).</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>8</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>1-8</dimIndex>
		<name>DAT%s</name>
		<description>A/D Channel 1 Data Register. This register contains the result of the most recent conversion completed on channel 1.</description>
		<addressOffset>0x024</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<readAction>modify</readAction>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[3:0]</bitRange>
			</field>
			<field>
				<name>RESULT</name>
				<description>This field contains the 12-bit A/D conversion result from the last conversion performed on this channel. This will be a binary fraction representing the voltage on the AD0[n] pin, as it falls within the range of VREFP to VREFN. Zero in the field indicates that the voltage on the input pin was less than, equal to, or close to that on VREFN, while 0xFFF indicates that the voltage on the input was close to, equal to, or greater than that on VREFP.</description>
				<bitRange>[15:4]</bitRange>
			</field>
			<field>
				<name>THCMPRANGE</name>
				<description>Threshold Range Comparison result. 0x0 = In Range: The last completed conversion was greater than or equal to the value programmed into the designated LOW threshold register (THRn_LOW) but less than or equal to the value programmed into the designated HIGH threshold register (THRn_HIGH). 0x1 = Below Range: The last completed conversion on was less than the value programmed into the designated LOW threshold register (THRn_LOW). 0x2 = Above Range: The last completed conversion was greater than the value programmed into the designated HIGH threshold register (THRn_HIGH). 0x3 = Reserved.</description>
				<bitRange>[17:16]</bitRange>
			</field>
			<field>
				<name>THCMPCROSS</name>
				<description>Threshold Crossing Comparison result. 0x0 = No threshold Crossing detected: The most recent completed conversion on this channel had the same relationship (above or below) to the threshold value established by the designated LOW threshold register (THRn_LOW) as did the previous conversion on this channel. 0x1 = Reserved. 0x2 = Downward Threshold Crossing Detected. Indicates that a threshold crossing in the downward direction has occurred - i.e. the previous sample on this channel was above the threshold value established by the designated LOW threshold register (THRn_LOW) and the current sample is below that threshold. 0x3 = Upward Threshold Crossing Detected. Indicates that a threshold crossing in the upward direction has occurred - i.e. the previous sample on this channel was below the threshold value established by the designated LOW threshold register (THRn_LOW) and the current sample is above that threshold.</description>
				<bitRange>[19:18]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[25:20]</bitRange>
			</field>
			<field>
				<name>CHANNEL</name>
				<description>This field is hard-coded to contain the channel number that this particular register relates to (i.e. this field will contain 0b0001 for the DAT1 register, 0b0010 for the DAT2 register, etc)</description>
				<bitRange>[29:26]</bitRange>
			</field>
			<field>
				<name>OVERRUN</name>
				<description>This bit will be set to a 1 if a new conversion on this channel completes and overwrites the previous contents of the RESULT field before it has been read - i.e. while the DONE bit is set. This bit is cleared, along with the DONE bit, whenever this register is read or when the data related to this channel is read from either of the global SEQn_GDAT registers. This bit (in any of the 8 registers) will cause an overrun interrupt request to be asserted if the overrun interrupt is enabled. While it is allowed to include the same channels in both conversion sequences, doing so may cause erratic behavior of the DONE and OVERRUN bits in the data registers associated with any of the channels that are shared between the two sequences. Any erratic OVERRUN behavior will also affect overrun interrupt generation, if enabled.</description>
				<bitRange>[30:30]</bitRange>
			</field>
			<field>
				<name>DATAVALID</name>
				<description>This bit is set to 1 when an A/D conversion on this channel completes. This bit is cleared whenever this register is read or when the data related to this channel is read from either of the global SEQn_GDAT registers. While it is allowed to include the same channels in both conversion sequences, doing so may cause erratic behavior of the DONE and OVERRUN bits in the data registers associated with any of the channels that are shared between the two sequences. Any erratic OVERRUN behavior will also affect overrun interrupt generation, if enabled.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>THR0_LOW</name>
		<description>A/D Low Compare Threshold Register 0 : Contains the lower threshold level for automatic threshold comparison for any channels linked to threshold pair 0.</description>
		<addressOffset>0x050</addressOffset>
		<access>read-write</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>THRLOW</name>
				<description>Low threshold value against which A/D results will be compared</description>
				<bitRange>[15:4]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>THR1_LOW</name>
		<description>A/D Low Compare Threshold Register 1: Contains the lower threshold level for automatic threshold comparison for any channels linked to threshold pair 1.</description>
		<addressOffset>0x054</addressOffset>
		<access>read-write</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>THRLOW</name>
				<description>Low threshold value against which A/D results will be compared</description>
				<bitRange>[15:4]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>THR0_HIGH</name>
		<description>A/D High Compare Threshold Register 0: Contains the upper threshold level for automatic threshold comparison for any channels linked to threshold pair 0.</description>
		<addressOffset>0x058</addressOffset>
		<access>read-write</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>THRHIGH</name>
				<description>High threshold value against which A/D results will be compared</description>
				<bitRange>[15:4]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>THR1_HIGH</name>
		<description>A/D High Compare Threshold Register 1: Contains the upper threshold level for automatic threshold comparison for any channels linked to threshold pair 1.</description>
		<addressOffset>0x05C</addressOffset>
		<access>read-write</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>THRHIGH</name>
				<description>High threshold value against which A/D results will be compared</description>
				<bitRange>[15:4]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CHAN_THRSEL</name>
		<description>A/D Channel-Threshold Select Register. Specifies which set of threshold compare registers are to be used for each channel</description>
		<addressOffset>0x060</addressOffset>
		<access>read-write</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CH1_THRSEL</name>
				<description>Threshold select by channel.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THRESHOLD_0</name>
						<description>Threshold 0. Channel 1 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRESHOLD_1</name>
						<description>Threshold 1. Channel 1 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CH2_THRSEL</name>
				<description>Threshold select by channel.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THRESHOLD_0</name>
						<description>Threshold 0. Channel 2 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRESHOLD_1</name>
						<description>Threshold 1. Channel 2 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CH3_THRSEL</name>
				<description>Threshold select by channel.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THRESHOLD_0</name>
						<description>Threshold 0. Channel 3 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRESHOLD_1</name>
						<description>Threshold 1. Channel 3 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CH4_THRSEL</name>
				<description>Threshold select by channel.</description>
				<bitRange>[4:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THRESHOLD_0</name>
						<description>Threshold 0. Channel 4 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRESHOLD_1</name>
						<description>Threshold 1. Channel 4 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CH5_THRSEL</name>
				<description>Threshold select by channel.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THRESHOLD_0</name>
						<description>Threshold 0. Channel 5 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRESHOLD_1</name>
						<description>Threshold 1. Channel 5 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CH6_THRSEL</name>
				<description>Threshold select by channel.</description>
				<bitRange>[6:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THRESHOLD_0</name>
						<description>Threshold 0. Channel 6 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRESHOLD_1</name>
						<description>Threshold 1. Channel 6 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CH7_THRSEL</name>
				<description>Threshold select by channel.</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THRESHOLD_0</name>
						<description>Threshold 0. Channel 7 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRESHOLD_1</name>
						<description>Threshold 1. Channel 7 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CH8_THRSEL</name>
				<description>Threshold select by channel.</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THRESHOLD_0</name>
						<description>Threshold 0. Channel 8 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THRESHOLD_1</name>
						<description>Threshold 1. Channel 8 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
		</fields>
	</register>
