cmsis-svd/cmsis-svd/data/NXP/LPC1125.svd
	<register>
		<name>PIO2_8</name>
		<description>I/O configuration for pin PIO2_8/ CT32B0_MAT3/U0_TXD</description>
		<addressOffset>0x024</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_8</name>
						<description>PIO2_8.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT32B0_MAT3</name>
						<description>CT32B0_MAT3.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>U0_TXD</name>
						<description>U0_TXD.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO2_1</name>
		<description>I/O configuration for pin PIO2_1/U0_DSR/SSP1_SCK</description>
		<addressOffset>0x028</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_1</name>
						<description>PIO2_1.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>U0_DSR</name>
						<description>U0_DSR.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_SCK</name>
						<description>SSP1_SCK.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO0_4</name>
		<description>I/O configuration for pin PIO0_4/I2C0_SCL</description>
		<addressOffset>0x030</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO0_4_OPEN_DRAIN_P</name>
						<description>PIO0_4 (open-drain pin).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>I2C0_SCL_OPEN_DRAIN</name>
						<description>I2C0_SCL (open-drain pin).</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>I2CMODE</name>
				<description>Selects I2C mode. Select Standard mode (I2CMODE = 00, default) or Standard I/O functionality (I2CMODE = 01) if the pin function is GPIO (FUNC = 000).</description>
				<bitRange>[9:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_FAST</name>
						<description>Standard mode/ Fast-mode I2C.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>STANDARDIO</name>
						<description>Standard I/O functionality</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FAST_MODE_PLUS_I2C</name>
						<description>Fast-mode Plus I2C</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO0_5</name>
		<description>I/O configuration for pin PIO0_5/I2C0_SDA</description>
		<addressOffset>0x034</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO0_5_OPEN_DRAIN_P</name>
						<description>PIO0_5 (open-drain pin).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>I2C0_SDA_OPEN_DRAIN</name>
						<description>I2C0_SDA (open-drain pin).</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>I2CMODE</name>
				<description>Selects I2C mode. Select Standard mode (I2CMODE = 00, default) or Standard I/O functionality (I2CMODE = 01) if the pin function is GPIO (FUNC = 000).</description>
				<bitRange>[9:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_FAST</name>
						<description>Standard mode/ Fast-mode I2C.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>STANDARDIO</name>
						<description>Standard I/O functionality</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>FAST_MODE_PLUS_I2C</name>
						<description>Fast-mode Plus I2C</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO1_9</name>
		<description>I/O configuration for pin PIO1_9/CT16B1_MAT0/SSP1_ MOSI</description>
		<addressOffset>0x038</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO1_9</name>
						<description>PIO1_9.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT16B1_MAT0</name>
						<description>CT16B1_MAT0.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_MOSI</name>
						<description>SSP1_MOSI.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO3_4</name>
		<description>I/O configuration for pin PIO3_4/ CT16B0_CAP1/U0_RXD</description>
		<addressOffset>0x03C</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO3_4</name>
						<description>PIO3_4.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT16B0_CAP1</name>
						<description>CT16B0_CAP1.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>U0_RXD</name>
						<description>U0_RXD.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO2_4</name>
		<description>I/O configuration for pin PIO2_4/ CT16B1_MAT1/ SSP1_SSEL</description>
		<addressOffset>0x040</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_4</name>
						<description>PIO2_4.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT16B1_MAT1</name>
						<description>CT16B1_MAT1.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_SSEL</name>
						<description>SSP1_SSEL.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO2_5</name>
		<description>I/O configuration for pin PIO2_5/ CT32B0_MAT0</description>
		<addressOffset>0x044</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_5</name>
						<description>PIO2_5.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT32B0_MAT0</name>
						<description>CT32B0_MAT0.</description>
						<value>0x1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
