cmsis-svd/cmsis-svd/data/NXP/LPC1125.svd
	<register>
		<name>PIO2_3</name>
		<description>I/O configuration for pin PIO2_3/U0_RI/SSP1_MOSI</description>
		<addressOffset>0x08C</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_3</name>
						<description>PIO2_3.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>U0_RI</name>
						<description>U0_RI.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_MOSI</name>
						<description>SSP1_MOSI.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SWDIO_PIO1_3</name>
		<description>I/O configuration for pin SWDIO/PIO1_3/ADC_3/CT32B1_MAT2</description>
		<addressOffset>0x090</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SWDIO</name>
						<description>SWDIO.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO1_3</name>
						<description>PIO1_3.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ADC_3</name>
						<description>ADC_3.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT32B1_MAT2</name>
						<description>CT32B1_MAT2.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>ADMODE</name>
				<description>Selects Analog/Digital mode</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ANALOG_INPUT_MODE</name>
						<description>Analog input mode</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DIGITAL_FUNCTIONAL_M</name>
						<description>Digital functional mode</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:8]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO1_4</name>
		<description>I/O configuration for pin PIO1_4/ADC_2/CT32B1_MAT3</description>
		<addressOffset>0x094</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. This pin functions as WAKEUP pin if the part is in Deep power-down mode regardless of the value of FUNC. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO1_4</name>
						<description>PIO1_4.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ADC_2</name>
						<description>ADC_2.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT32B1_MAT3</name>
						<description>CT32B1_MAT3.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>ADMODE</name>
				<description>Selects Analog/Digital mode</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ANALOG_INPUT_MODE</name>
						<description>Analog input mode</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DIGITAL_FUNCTIONAL_M</name>
						<description>Digital functional mode</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:8]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO1_11</name>
		<description>I/O configuration for pin PIO1_11/ADC_1/CT32B1_CAP1</description>
		<addressOffset>0x098</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO1_11</name>
						<description>PIO1_11.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ADC_1</name>
						<description>ADC_1.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT32B1_CAP1</name>
						<description>CT32B1_CAP1.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>ADMODE</name>
				<description>Selects Analog/Digital mode</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ANALOG_INPUT_MODE</name>
						<description>Analog input mode</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>DIGITAL_FUNCTIONAL_M</name>
						<description>Digital functional mode</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:8]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO3_2</name>
		<description>I/O configuration for pin PIO3_2/U0_DCD/ CT16B0_MAT2/SSP1_SCK</description>
		<addressOffset>0x09C</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO3_2</name>
						<description>PIO3_2.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>U0_DCD</name>
						<description>U0_DCD.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT16B0_MAT2</name>
						<description>CT16B0_MAT2.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SSP1_SCK</name>
						<description>SSP1_SCK.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO1_5</name>
		<description>I/O configuration for pin PIO1_5/U0_RTS/CT32B0_CAP0</description>
		<addressOffset>0x0A0</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO1_5</name>
						<description>PIO1_5.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>U0_RTS</name>
						<description>U0_RTS.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT32B0_CAP0</name>
						<description>CT32B0_CAP0.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
