cmsis-svd/cmsis-svd/data/NXP/LPC1125.svd
	<register>
		<name>PIO1_6</name>
		<description>I/O configuration for pin PIO1_6/U0_RXD/CT32B0_MAT0</description>
		<addressOffset>0x0A4</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO1_6</name>
						<description>PIO1_6.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>U0_RXD</name>
						<description>U0_RXD.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT32B0_MAT0</name>
						<description>CT32B0_MAT0.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO1_7</name>
		<description>I/O configuration for pin PIO1_7/U0_TXD/CT32B0_MAT1</description>
		<addressOffset>0x0A8</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO1_7</name>
						<description>PIO1_7.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>U0_TXD</name>
						<description>U0_TXD.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT32B0_MAT1</name>
						<description>CT32B0_MAT1.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIO3_3</name>
		<description>I/O configuration for pin PIO3_3/U0_RI/ CT16B0_CAP0</description>
		<addressOffset>0x0AC</addressOffset>
		<access>read-write</access>
		<resetValue>0xD0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>FUNC</name>
				<description>Selects pin function. All other values are reserved.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO3_3</name>
						<description>PIO3_3.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>U0_RI</name>
						<description>U0_RI.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CT16B0_CAP0</name>
						<description>CT16B0_CAP0.</description>
						<value>0x2</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MODE</name>
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
				<bitRange>[4:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>INACTIVE_NO_PULL_DO</name>
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_DOWN_RESISTOR_E</name>
						<description>Pull-down resistor enabled.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PULL_UP_RESISTOR_ENA</name>
						<description>Pull-up resistor enabled.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATER_MODE</name>
						<description>Repeater mode.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>HYS</name>
				<description>Hysteresis.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[9:6]</bitRange>
			</field>
			<field>
				<name>OD</name>
				<description>Selects pseudo open-drain mode.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>STANDARD_GPIO_OUTPUT</name>
						<description>Standard GPIO output</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>OPEN_DRAIN_OUTPUT</name>
						<description>Open-drain output</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SCK0_LOC</name>
		<description>SCK0 pin location select register</description>
		<addressOffset>0x0B0</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SCKLOC</name>
				<description>Selects pin location for SSP0_SCK function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO0_10</name>
						<description>PIO0_10. Selects SCK0 function in pin location SWCLK/PIO0_10.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO0_6</name>
						<description>PIO0_6. Selects SSP0_SCK function in pin location PIO0_6.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DSR_LOC</name>
		<description>DSR pin location select register</description>
		<addressOffset>0x0B4</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DSRLOC</name>
				<description>Selects pin location for U0_DSR function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_1</name>
						<description>PIO2_1. Selects U0_DSR function in pin location PIO2_1</description>
						<value>0x0</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>DCD_LOC</name>
		<description>DCD pin location select register</description>
		<addressOffset>0x0B8</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DCDLOC</name>
				<description>Selects pin location for U0_DCD function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_2</name>
						<description>PIO2_2. Selects U0_DCD function in pin location PIO2_2.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO3_2</name>
						<description>PIO3_2. Selects U0_DCD function in pin location PIO3_2.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>RI_LOC</name>
		<description>RI pin location select register</description>
		<addressOffset>0x0BC</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RILOC</name>
				<description>Selects pin location for U0_RI function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_3</name>
						<description>PIO2_3. Selects UO_RI function in pin location PIO2_3.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO3_3</name>
						<description>PIO3_3. Selects U0_RI function in pin location PIO3_3.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
		<register>
			<name>PIO0_3</name>
			<description>I/O configuration for pin PIO0_3/R/R/U2_RXD</description>
			<addressOffset>0x0C0</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>PIO0_3</name>
							<description>PIO0_3.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>U2_RXD</name>
							<description>U2_RXD.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:6]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIO0_6</name>
			<description>I/O configuration for pin PIO0_6/SSP0_SCK/U1_TXD</description>
			<addressOffset>0x0C4</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>PIO0_6</name>
							<description>PIO0_6.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP0_SCK_ONLY_IF_PI</name>
							<description>SSP0_SCK (only if pin PIO0_6/SSP0_SCK selected in the SCK0_LOC register).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>U1_TXD</name>
							<description>U1_TXD.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:6]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
