cmsis-svd/cmsis-svd/data/NXP/LPC1125.svd
		<register>
			<name>PIO0_7</name>
			<description>I/O configuration for pin PIO0_7/U0_CTS/ADC_PIN_TRIG1/U1_RXD</description>
			<addressOffset>0x0C8</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>PIO0_7</name>
							<description>PIO0_7.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>U0_CTS</name>
							<description>U0_CTS.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADC_PIN_TRIG1</name>
							<description>ADC_PIN_TRIG1.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>U1_RXD</name>
							<description>U1_RXD.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:6]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
	<register>
		<name>SSEL1_LOC</name>
		<description>SSEL1 pin location select register</description>
		<addressOffset>0x0CC</addressOffset>
		<access>read-write</access>
		<resetValue>0x0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SSEL1LOC</name>
				<description>Selects pin location for SSP1_SSEL function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_0</name>
						<description>PIO2_0. Selects SSP1_SSEL function in pin location PIO2_0.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO2_4</name>
						<description>PIO2_4. Selects SSP1_SSEL function in pin location  PIO2_4.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CT16B0_CAP0_LOC</name>
		<description>CT16B0_CAP0 pin location select register</description>
		<addressOffset>0x0D0</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CT16B0_CAP0LOC</name>
				<description>Selects pin location for CT16B0_CAP0 function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO0_2</name>
						<description>PIO0_2. Selects CT16B0_CAP0 function in pin location PIO0_2.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO3_3</name>
						<description>PIO3_3. Selects CT16B0_CAP0 function in pin location PIO3_3.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SCK1_LOC</name>
		<description>SCK1 pin location select register</description>
		<addressOffset>0x0D4</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SCK1LOC</name>
				<description>Selects pin location for SSP1_SCK function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_1</name>
						<description>PIO2_1. Selects SSP1_SCK function in pin location PIO2_1.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO3_2</name>
						<description>PIO3_2. Selects SSP1_SCK function in pin location PIO3_2.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MISO1_LOC</name>
		<description>MISO1 pin location select register</description>
		<addressOffset>0x0D8</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MISO1LOC</name>
				<description>Selects pin location for the SSP1_MISO function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_2</name>
						<description>PIO2_2. Selects SSP1_MISO function in pin location PIO2_2.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO1_10</name>
						<description>PIO1_10. Selects SSP1_MISO function in pin location PIO1_10.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MOSI1_LOC</name>
		<description>MOSI1 pin location select register</description>
		<addressOffset>0x0DC</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MOSI1LOC</name>
				<description>Selects pin location for the SSP1_MOSI function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO2_3</name>
						<description>PIO2_3. Selects SSP1_MOSI1 function in pin location PIO2_3.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO1_9</name>
						<description>PIO1_9. Selects SSP1_MOSI function in pin location PIO1_9.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CT32B0_CAP0_LOC</name>
		<description>CT32B0_CAP0 pin location select register</description>
		<addressOffset>0x0E0</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>CT32B0_CAP0LOC</name>
				<description>Selects pin location for the CT32B0_CAP0 function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO1_5</name>
						<description>PIO1_5. Selects CT32B0_CAP0 function in pin location PIO1_5.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO2_9</name>
						<description>PIO2_9. Selects CT32B0_CAP0 function in pin location PIO2_9.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>RXD_LOC</name>
		<description>RXD pin location select register</description>
		<addressOffset>0x0E4</addressOffset>
		<access>read-write</access>
		<resetValue>0x00</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RXDLOC</name>
				<description>Selects pin location for the U0_RXD function.</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>PIO1_6</name>
						<description>PIO1_6. Selects U0_RXD function in pin location PIO1_6.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO2_7</name>
						<description>PIO2_7. Selects RXD function in pin location PIO2_7.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>PIO3_4</name>
						<description>PIO3_4. Selects RXD function in pin location PIO3_4.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
