cmsis-svd/cmsis-svd/data/NXP/LPC1125.svd
	<register>
		<name>SYSAHBCLKCTRL</name>
		<description>System AHB clock control</description>
		<addressOffset>0x080</addressOffset>
		<access>read-write</access>
		<resetValue>0x85F</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SYS</name>
				<description>Enables clock for AHB to APB bridge, to the AHB matrix, to the Cortex-M0 FCLK and HCLK, to the SysCon, and to the PMU. This bit is read only.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>ROM</name>
				<description>Enables clock for ROM.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RAM</name>
				<description>Enables clock for RAM.</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>FLASHREG</name>
				<description>Enables clock for flash register interface.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>FLASHARRAY</name>
				<description>Enables clock for flash array access.</description>
				<bitRange>[4:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>I2C</name>
				<description>Enables clock for I2C.</description>
				<bitRange>[5:5]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>GPIO</name>
				<description>Enables clock for GPIO.</description>
				<bitRange>[6:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CT16B0</name>
				<description>Enables clock for 16-bit counter/timer 0.</description>
				<bitRange>[7:7]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CT16B1</name>
				<description>Enables clock for 16-bit counter/timer 1.</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CT32B0</name>
				<description>Enables clock for 32-bit counter/timer 0.</description>
				<bitRange>[9:9]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CT32B1</name>
				<description>Enables clock for 32-bit counter/timer 1.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SSP0</name>
				<description>Enables clock for SSP0.</description>
				<bitRange>[11:11]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>UART0</name>
				<description>Enables clock for UART0.</description>
				<bitRange>[12:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>ADC</name>
				<description>Enables clock for 12-bit ADC.</description>
				<bitRange>[13:13]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>WDT</name>
				<description>Enables clock for WWDT.</description>
				<bitRange>[15:15]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>IOCON</name>
				<description>Enables clock for I/O configuration block.</description>
				<bitRange>[16:16]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[17:17]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SSP1</name>
				<description>Enables clock for SSP1.</description>
				<bitRange>[18:18]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>UART1</name>
				<description>Enables clock for UART1.</description>
				<bitRange>[19:19]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>UART2</name>
				<description>Enables clock for UART2.</description>
				<bitRange>[20:20]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLE</name>
						<description>Disable</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLE</name>
						<description>Enable</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:21]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SSP0CLKDIV</name>
		<description>SSP0 clock divider</description>
		<addressOffset>0x094</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DIV</name>
				<description>SSP0_PCLK clock divider values 0: Disable SSP0_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>UART0CLKDIV</name>
		<description>UART0 clock divider</description>
		<addressOffset>0x098</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DIV</name>
				<description>UART0_PCLK clock divider values 0: Disable UART0_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SSP1CLKDIV</name>
		<description>SSP1 clock divider</description>
		<addressOffset>0x09C</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DIV</name>
				<description>SSP1_PCLK clock divider values 0: Disable SSP1_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>UART1CLKDIV</name>
		<description>UART1 clock divider</description>
		<addressOffset>0x0A0</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DIV</name>
				<description>UART1_PCLK clock divider values 0: Disable UART1_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>UART2CLKDIV</name>
		<description>UART2 clock divider</description>
		<addressOffset>0x0A4</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DIV</name>
				<description>UART2_PCLK clock divider values 0: Disable UART2_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>WDTCLKSEL</name>
		<description>WDT clock source select</description>
		<addressOffset>0x0D0</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SEL</name>
				<description>WDT clock source</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>IRC_OSCILLATOR</name>
						<description>IRC oscillator</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MAIN_CLOCK</name>
						<description>Main clock</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>WATCHDOG_OSCILLATOR</name>
						<description>Watchdog oscillator</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED</name>
						<description>Reserved</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>WDTCLKUEN</name>
		<description>WDT clock source update enable</description>
		<addressOffset>0x0D4</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ENA</name>
				<description>Enable WDT clock source update</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_CHANGE</name>
						<description>No change</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>UPDATE_CLOCK_SOURCE</name>
						<description>Update clock source</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>WDTCLKDIV</name>
		<description>WDT clock divider</description>
		<addressOffset>0x0D8</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DIV</name>
				<description>WDT clock divider values 0: Disable WDCLK.  1: Divide by 1. to 255: Divide by 255.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLKOUTCLKSEL</name>
		<description>CLKOUT clock source select</description>
		<addressOffset>0x0E0</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SEL</name>
				<description>CLKOUT clock source</description>
				<bitRange>[1:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>IRC_OSCILLATOR</name>
						<description>IRC oscillator</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SYSTEM_OSCILLATOR</name>
						<description>System oscillator</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>WATCHDOG_OSCILLATOR</name>
						<description>Watchdog oscillator</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>MAIN_CLOCK</name>
						<description>Main clock</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:2]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLKOUTUEN</name>
		<description>CLKOUT clock source update enable</description>
		<addressOffset>0x0E4</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ENA</name>
				<description>Enable CLKOUT clock source update</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_CHANGE</name>
						<description>No change</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>UPDATE_CLOCK_SOURCE</name>
						<description>Update clock source</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:1]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>CLKOUTCLKDIV</name>
		<description>CLKOUT clock divider</description>
		<addressOffset>0x0E8</addressOffset>
		<access>read-write</access>
		<resetValue>0x000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DIV</name>
				<description>Clock output divider values 0: Disable CLKOUT.  1: Divide by 1. to 255: Divide by 255.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIOPORCAP0</name>
		<description>POR captured PIO status 0</description>
		<addressOffset>0x100</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>CAPPIO0_n</name>
				<description>Raw reset status input PIO0_n: PIO0_11 to PIO0_0</description>
				<bitRange>[11:0]</bitRange>
			</field>
			<field>
				<name>CAPPIO1_n</name>
				<description>Raw reset status input PIO1_n: PIO1_11 to PIO1_0</description>
				<bitRange>[23:12]</bitRange>
			</field>
			<field>
				<name>CAPPIO2_n</name>
				<description>Raw reset status input PIO2_n: PIO2_7 to PIO2_0</description>
				<bitRange>[31:24]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>PIOPORCAP1</name>
		<description>POR captured PIO status 1</description>
		<addressOffset>0x104</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>CAPPIO2_8</name>
				<description>Raw reset status input PIO2_8</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>CAPPIO2_9</name>
				<description>Raw reset status input PIO2_9</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>CAPPIO2_10</name>
				<description>Raw reset status input PIO2_10</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>CAPPIO2_11</name>
				<description>Raw reset status input PIO2_11</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>CAPPIO3_0</name>
				<description>Raw reset status input PIO3_0</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>CAPPIO3_1</name>
				<description>Raw reset status input PIO3_1</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>CAPPIO3_2</name>
				<description>Raw reset status input PIO3_2</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>CAPPIO3_3</name>
				<description>Raw reset status input PIO3_3</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>CAPPIO3_4</name>
				<description>Raw reset status input PIO3_4</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>CAPPIO3_5</name>
				<description>Raw reset status input PIO3_5</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:10]</bitRange>
			</field>
		</fields>
	</register>
